/* conjunction to end a compound sentence */
" and" = " ja";

/* No comment provided by engineer. */
"%@" = "%@";

/* Account Name (Connecting) - shown for an account while it is connecting */
"%@ (Connecting)" = "%@ (Kirjaudutaan sisään)";

/* No comment provided by engineer. */
"%@ is not on any account. Please select a specific account or add this contact first." = "%@ is not on any account. Please select a specific account or add this contact first.";

/* No comment provided by engineer. */
"%@ on the account %@" = "%1$@ on the account %2$@";

/* Event: <A contact's name> requested authorization */
"%@ requested authorization" = "%@ requested authorization";

/* This is displayed in the message window when prompting to receive a file. The first %@ is the sender; the second %@ is the filename of the file being sent. It will be followed by buttons such as 'Save' and 'Cancel'. */
"%@ requests to send you %@" = "%1$@ haluaa lähettää sinulle tiedoston %2$@";

/* Message displayed when a contact sends a buzz/nudge/other notification. %@ will be the other person's name. */
"%@ wants your attention!" = "%@ haluaa huomiosi!";

/* comma between actions in the events list */
"," = ",";

/* period at the end of the Events pane sentence describing actions taken for an event */
"." = ".";

/* Status message for a bookmark (1 mention, 1 message) */
"1 mention, 1 message" = "1 mention, 1 message";

/* Status message for a bookmark (1 message) */
"1 message" = "1 message";

/* Colon which will be appended after a label such as 'User Name', before an input field */
":" = ":";

/* please keep the semicolon at the start of the line. %@ will be replaced by a status message. This is used when reading an entry in the contact list aloud, such as 'Evan Schoenberg; status message I am bouncing up and down' */
"; status message %@" = "; tilaviesti %@";

/* Placeholder displayed as the name of a new account */
"<New Account>" = "<Uusi tunnus>";

/* No comment provided by engineer. */
"\"%@\" is already in use." = "\"%@\" on jo käytössä.";

/* No comment provided by engineer. */
"a member of %@" = "a member of %@";

/* No comment provided by engineer. */
"Account:" = "Tunnus:";

/* Label for contact alert action (e.g. Send message, Play sound, etc.) */
"Action:" = "Toiminto:";

/* No comment provided by engineer. */
"Add Account" = "Lisää tunnus";

/* No comment provided by engineer. */
"Add an action for the selected event" = "Lisää toiminto valittuun tapahtumaan";

/* No comment provided by engineer. */
"Adium provides encryption, authentication, deniability, and perfect forward secrecy over %@ via Off-the-Record Messaging (OTR). If your contact is not using an OTR-compatible messaging system, your contact will be sent a link to the OTR web site when you attempt to connect. For more information on OTR, visit https://otr.cypherpunks.ca/." = "Adium mahdollistaa täysin turvallisten salattujen OTR-keskusteluiden käymisen %@ tunnuksella. Jos ystävä, jonka kanssa keskustelet, ei käytä OTR-yhteensopivaa tunnusta, hänelle tullaan lähettämään linkki OTR internet sivustolle kun keskustelu aloitetaan. Saadaksesi lisää tietoja OTR-salauksesta vieraile internet sivustolla https://otr.cypherpunks.ca/.";

/* No comment provided by engineer. */
"Alias:" = "Viestinimi:";

/* No comment provided by engineer. */
"Any" = "Any";

/* No comment provided by engineer. */
"Authorization Requests" = "Authorization Requests";

/* No comment provided by engineer. */
"Authorize" = "Authorize";

/* No comment provided by engineer. */
"Authorize and Add" = "Authorize and Add";

/* No comment provided by engineer. */
"Authorize Selected" = "Authorize Selected";

/* No comment provided by engineer. */
"Bookmarks" = "Bookmarks";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* Cancel current account activity prefix */
"Cancel: %@" = "Peruuta: %@";

/* No comment provided by engineer. */
"Cannot open sound set" = "Äänivalikoimaa ei voida avata";

/* No comment provided by engineer. */
"Clear" = "Pyyhi";

/* No comment provided by engineer. */
"Configure the selected action" = "Mukauta valittua toimintoa";

/* No comment provided by engineer. */
"Connect" = "Yhdistä";

/* Connect account prefix */
"Connect: %@" = "Kirjaa sisään: %@";

/* %@ will be the name of a group in the contact list */
"contact group %@" = "Ystäväryhmä %@";

/* No comment provided by engineer. */
"Contact List" = "Contact List";

/* No comment provided by engineer. */
"Contact not found" = "Contact not found";

/* No comment provided by engineer. */
"Contact requests authorization" = "Contact requests authorization";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Custom" = "Mukautettu";

/* Button which deletes the selection */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete Account" = "Poista tunnus";

/* New contact alert pane */
"Delete after event occurs" = "Poista tapahtuman jälkeen";

/* No comment provided by engineer. */
"Delete Event?" = "Poista tapahtuma?";

/* No comment provided by engineer. */
"Delete the account %@?" = "Haluatko poistaa tunnuksen %@?";

/* No comment provided by engineer. */
"Deny" = "Deny";

/* No comment provided by engineer. */
"Deny and Block" = "Deny and Block";

/* No comment provided by engineer. */
"Deny Selected" = "Deny Selected";

/* No comment provided by engineer. */
"Disable" = "Poista käytöstä";

/* %@ will be the name of a plugin. This is the title of the dialogue shown when an unknown plugin is loaded */
"Disable %@?" = "Poista käytöstä %@?";

/* No comment provided by engineer. */
"Disabled Accounts" = "Käytöstä poistetut tunnukset";

/* No comment provided by engineer. */
"Disconnect" = "Katkaise yhteys";

/* Disconnect account prefix */
"Disconnect: %@" = "Kirjaa ulos: %@";

/* Button which indicates that the editing sheet is done */
"Done" = "Valmis";

/* Button which duplicates the selection */
"Duplicate" = "Monista";

/* No comment provided by engineer. */
"Edit Account" = "Muokkaa tunnusta";

/* Edit In Address Book Contextual Menu */
"Edit In Address Book" = "Edit In Address Book";

/* No comment provided by engineer. */
"Edit Link" = "Muokkaa linkkiä";

/* No comment provided by engineer. */
"Edit presets:" = "Muuta valikoimia:";

/* No comment provided by engineer. */
"Enable" = "Ota käyttöön";

/* Enable account prefix */
"Enable %@" = "Ota käyttöön %@";

/* Label besides the encryption preference menu */
"Encryption:" = "Salaus:";

/* No comment provided by engineer. */
"Error" = "Error";

/* Label for contact alert event (e.g. Contact signed on, Message received, etc.) */
"Event:" = "Tapahtuma:";

/* No comment provided by engineer. */
"Events" = "Tapahtumat";

/* No comment provided by engineer. */
"External plugins may cause crashes and odd behavior after updating Adium.  Disable this plugin if you experience any issues." = "Ulkoiset lisäosat saattavat tehdä Adiumista epävakaan päivitysten yhteydessä. Poista tämä lisäosa käytöstä. mikäli oireita ilmenee.";

/* No comment provided by engineer. */
"Get Info" = "Get Info";

/* %@ will be the name of a bookmark */
"group chat bookmark %@" = "ryhmäkeskustelukirjanmerkki %@";

/* No comment provided by engineer. */
"Idle" = "Ei aktiivinen";

/* No comment provided by engineer. */
"Ignore" = "Ignore";

/* No comment provided by engineer. */
"Ignore and Block" = "Ignore and Block";

/* No comment provided by engineer. */
"Ignore Selected" = "Ignore Selected";

/* No comment provided by engineer. */
"Invalid status icon pack" = "Viallinen tilakuvakepaketti";

/* No comment provided by engineer. */
"Join" = "Liity";

/* No comment provided by engineer. */
"Join Chat" = "Liity keskusteluun";

/* Text of the typing preference checkbox in the account preferences */
"Let others know when you are typing" = "Näytä muille milloin kirjoitan viestiä";

/* Label for the login server field in the account preferences */
"Login Server:" = "Kirjautumispalvelin:";

/* No comment provided by engineer. */
"New Alert" = "Uusi ilmoitus";

/* No comment provided by engineer. */
"No" = "No";

/* No comment provided by engineer. */
"No compatible accounts connected" = "Ei yhteensopivia tunnuksia kirjattuna sisään";

/* No comment provided by engineer. */
"OK" = "Ok";

/* Label for the password field in the account preferences */
"Password:" = "Salasana:";

/* No comment provided by engineer. */
"Paste" = "Sijoita";

/* %@ will be the name of a plugin. This is the title of the dialogue shown when an plugin is loaded on an unsupported architecture. */
"Plugin %@ Will be Disabled" = "Plugin %@ Will be Disabled";

/* Label for the port field in the account preferences */
"Port:" = "Portti:";

/* No comment provided by engineer. */
"Remove the selected action(s)" = "Poista valitut toiminnot?";

/* Button which renames the selection */
"Rename" = "Nimeä uudelleen";

/* Event: requested authorization (follows a contact's name displayed as a header) */
"requested authorization" = "requested authorization";

/* No comment provided by engineer. */
"Requests authorization" = "Requests authorization";

/* No comment provided by engineer. */
"Set to Current Adium Status" = "Aseta Adiumin tilaksi";

/* Show In Address Book Contextual Menu */
"Show In Address Book" = "Show In Address Book";

/* No comment provided by engineer. */
"Social Networking" = "Social Networking";

/* No comment provided by engineer. */
"Social Networking Status" = "Social Networking Status";

/* No comment provided by engineer. */
"Social Networking Status:" = "Social Networking Status:";

/* No comment provided by engineer. */
"Sound set upgrade failed" = "Äänipaketin päivittäminen epäonnistui";

/* No comment provided by engineer. */
"The active status icon pack \"%@\" installed at \"%@\" is invalid.  It is missing the required status icon \"%@\".  If you received this pack from xtras.adium.im, please contact its author. Your status icon setting will be restored to the default." = "Nykyinen tilakuvakepaketti (%1$@), joka on asennettu kohteeseen \"%2$@\" on virheellinen. Se ei sisällä vaadittua kuvaketta tilalle \"%3$@\". Mikäli tämä paketti on peräisin osoitteesta xtras.adium.im, ole hyvä ja ota yhteyttä sen tekijään. Tilakuvakkeesi palautetaan vakioasetuksiin.";

/* No comment provided by engineer. */
"The bookmark %@ does not contain enough information and can not be used. Please recreate it next time you join the chat.\nWould you like to remove this bookmark?" = "The bookmark %@ does not contain enough information and can not be used. Please recreate it next time you join the chat.\nWould you like to remove this bookmark?";

/* No comment provided by engineer. */
"The characters you're entering are not valid for an account name on this service." = "Antamasi merkit eivät ole sallittuja tämän tyyppisten tunnusten nimissä.";

/* No comment provided by engineer. */
"The sound set %@ is version %i, and this version of Adium does not know how to handle that; perhaps try a later version of Adium." = "Äänipaketti %1$@ on versiota %2$i, eikä tämä Adiumin versio osaa käsitellä sitä. Ole hyvä ja varmista että sinulla on uusin versio Adiumista.";

/* No comment provided by engineer. */
"This plugin does not support your native architecture." = "This plugin does not support your native architecture.";

/* No comment provided by engineer. */
"This version of Adium uses a new format for sound sets. Adium was not able to update the sound set %@ located at %@. It has been disabled." = "Tämä Adiumin versio käyttää uudenlaisia äänipaketteja. Adium ei pystynyt päivittämään äänipakettia \"%1$@\" joka sijaitsee kohteessa \"%2$@\". Äänipaketti on poistettu käytöstä.";

/* Label in front of the title for a preset */
"Title:" = "Otsikko:";

/* Label beside the 'let others know when you are typing' checkbox in the account preferences */
"Typing:" = "Kirjoittaminen:";

/* No comment provided by engineer. */
"Unable to join bookmarked chat" = "Unable to join bookmarked chat";

/* No comment provided by engineer. */
"Unknown" = "Tuntematon";

/* No comment provided by engineer. */
"User Name" = "Käyttäjän nimi";

/* No comment provided by engineer. */
"When %@ requests authorization" = "When %@ requests authorization";

/* No comment provided by engineer. */
"When a contact requests authorization" = "When a contact requests authorization";

/* No comment provided by engineer. */
"Yes" = "Yes";

/* Displayed in an open chat when its account has been connected */
"You have connected" = "Olet yhdistänyt palveluun";

/* Displayed in an open chat when its account has been connected */
"You have disconnected" = "Olet katkaissut yhteyden palveluun";

/* Message displayed when you send a buzz/nudge/other notification. %@ will be the other person's name. */
"You requested %@'s attention" = "Yritit kiinnittää käyttäjän %@ huomion";

/* No comment provided by engineer. */
"Your attention is requested!" = "Huomiotasi tarvitaan!";
/* Restored from historic nib translations (arm64 revival) */
"Appear Idle Immediately" = "Appear Idle Immediately";
"Auto-reply" = "Auto-reply";
"Custom Status" = "Mukautettu tila";
"Hours" = "Tunnnit";
"Minutes" = "Minuutit";
"Mute Sounds" = "Mykistä äänet";
"Save Custom Status" = "Tallenna mukautettu tila";
"Silence Notifications" = "Hiljennä ilmoitukset";
"State:" = "State:";
"Status Message:" = "Tilaviesti:";
"With a custom auto-reply message:" = "With a custom auto-reply message:";

/* Adium arm64 revival */
"Let others know when you have read their messages" = "Näytä muille milloin olen lukenut heidän viestinsä";
"Read receipts:" = "Lukukuittaukset:";

/* Strings the code localizes which had never been extracted; English value = key. */
"%lu authorization requests" = "%lu lupapyyntöä";
"%lu mentions, %lu messages" = "%lu mainintaa, %lu viestiä";
"%lu messages" = "%lu viestiä";
"1 mention, %lu messages" = "1 maininta, %lu viestiä";
"Clear the field to let Adium name this status after its message." = "Tyhjennä kenttä, niin Adium nimeää tämän tilan sen viestin mukaan.";
"No notifications in Notification Center while this status is active." = "Ei ilmoituksia Ilmoituskeskuksessa, kun tämä tila on käytössä.";
"No sounds and no spoken messages for this account's contacts." = "Ei ääniä eikä puhuttuja viestejä tämän tunnuksen ystäviltä.";
"Quiet" = "Hiljainen";
"Remove the %lu actions associated with this event?" = "Poista %lu toimintoa tästä tapahtumasta?";
"Saved statuses appear in the status menu." = "Tallennetut tilat näkyvät tilavalikossa.";
"Status" = "Tila";
"Status Message" = "Tilaviesti";
"Title" = "Otsikko";

/* The rebuilt account area: rows and sections built by AIAccountPlan and
   AIAccountPlanFormBuilder. Those classes live in the framework, so the
   lookup happens here and not in the application table. */
/* No comment provided by engineer. */
"Password" = "Salasana";

/* No comment provided by engineer. */
"Display Name" = "Viestinimi";

/* Account privacy row: whether typing is reported to the other side */
"Let others know when I am typing" = "Näytä muille milloin kirjoitan viestiä";

/* Account privacy row: whether read receipts are sent */
"Let others know when I have read their messages" = "Näytä muille milloin olen lukenut heidän viestinsä";

/* No comment provided by engineer. */
"Encryption" = "Salaus";

/* Section header above an account's name and password */
"Account" = "Tunnus";

/* Section header above an account's personal details */
"Personal" = "Oma profiili";

/* Section header above an account's options */
"Options" = "Valinnat";

/* Section header above the options a protocol offers beyond the usual ones */
"More Options" = "Lisävalinnat";

/* Section header above an account's privacy settings */
"Privacy" = "Yksityisyys";

/* Older string from the plugin loader that still appeared in English */
/* %@ will be a version number of Adium */
"This plugin is known to be incompatible with Adium %@." = "Tämä plugin ei ole yhteensopiva Adiumin version %@ kanssa.";
